WELCOME_MESSAGE = "✈<b>Добро пожаловать</b> <i>в главное меню чат-бота Управляющей компании \"УЭР-ЮГ\"</i>." \
                  "  Здесь вы можете оставить заявку для управляющей компании или направить свое предложение" \
                  " по управлению домом. Просто воспользуйтесь кнопками <b><i>меню</i></b>," \
                  " чтобы взаимодействовать с функциями бота:"

FIRST_MESSAGE = "<b>☀ Доброго времени суток,</b> бот создан, чтобы обрабатывать заявки и обращения пользователей. " \
                "Чтобы воспользоваться этим, пришлите для начала Ваше <b>Имя</b> и <b>Фамилию</b>"

PHONE_NUMBER_MESSAGE = '📞 Теперь отправьте Ваш <b>номер телефона</b> через <b>+7</b> следующим сообщением'

NAME_ERROR_MESSAGE = "⛔️📛<b>Имя</b> и <b>Фамилия</b> должны быть введены через один <i>пробел,</i>" \
                     " и должны быть написаны через <i>кириллицу</i>. Также должны начинаться с заглавных букв." \
                     " Учтите формат и попробуйте снова:"

PHONE_ERROR_MESSAGE = '⛔️📛⛔️<b>Номер телефона</b> должен содержать 11 цифр и должен обязательно содержать ' \
                      'в начале <b>+7. Учтите формат и попробуйте снова:</b>'

REQUEST_MENU_MESSAGE = "📛👇📛 <i>Выберите категорию, по которой Вы хотите оставить заявку в УК:</i>"

ADDRESS_MESSAGE = '<i><b>Шаг 1/3</b></i>. 📓 Напишите адрес или ориентир проблемы (улицу, номер дома, ' \
                  'подъезд, этаж и квартиру) или пропустите этот пункт:'

MEDIA_MESSAGE = "<b>Шаг 2/3</b>🖼️Прикрепите фотографию" \
                " или видео к своей заявке или пропустите этот пункт"

MEDIA_ERROR_MESSAGE = "⛔️📛В данном пункте нужно обязательно отправить <b>фотографию</b> или " \
                      "<b>видео</b> в виде медиа-сообщения. <b>Попробуйте ещё раз:</b>"

DESCRIPTION_MESSAGE = "<b>Шаг 3/3</b>️📛Напишите причину обращения в подробностях"

REQUEST_THANK_YOU_MESSAGE = "✅<b>Жалоба отправлена администрации.</b> <i>Спасибо за Ваше обращение!</i>"

OFFER_MESSAGE = "💡<b>Распишите Ваше предложение в подробностях: (Добавьте фотографию, если есть)</b>"

OFFER_THANKS = "✅💡<b>Идея принята и передана администрации</b> <i>Спасибо за Ваше обращение</i>"

CONTACTS = '<u>Управляющая компания:</u>\n<b>Диспетчерская служба ООО «УЭР-ЮГ»</b>\n<code>+7 4722 35-50-06</code>\n' \
           '<b>Инженеры ООО «УЭР-ЮГ»</b>\n<code>+7 920 566-28-86</code>\n' \
           '<b>Бухгалтерия ООО «УЭР-ЮГ»</b>\n<code>+7 4722 35-50-06</code>\n' \
           '<i>Белгород, Свято-Троицкий б-р, д. 15, подъезд No 1</i>\n\n' \
           '<u>Телефоны для открытия ворот и шлагбаума:</u>\n' \
           '<b>Шлагбаум «Набережная»</b>\n<code>+7 920 554-87-74</code>\n' \
           '<b>Ворота «Харьковские»</b>\n<code>+7 920 554-87-40</code>\n' \
           '<b>Ворота «Мост»</b>\n<code>+7 920 554-64-06</code>\n' \
           '<b>Калитка 1 «Мост»</b>\n<code>+7 920 554-42-10</code>\n' \
           '<b>Калитка 2 «Мост»</b>\n<code>+7 920 554-89-04</code>\n' \
           '<b>Калитка 3 «Харьковская»</b>\n<code>+7 920 554-87-39</code>\n' \
           '<b>Калитка 4 «Харьковская»</b>\n<code>+7 920 554-89-02</code>\n\n' \
           '<b>Охрана</b>\n' \
           '<code>+7 915 57-91-457</code>\n\n' \
           '<b>Участковый</b>\n' \
           'Куленцова Марина Владимировна\n' \
           '<code>+7 999 421-53-72</code>'

SETTINGS_MESSAGE = 'Тут Вы сможете поменять <b>Имя</b> и <b>Фамилию</b> в Базе данных' \
                   ' нашего бота или же можете поменять ' \
                   f'Ваш <b>номер телефона</b>, если Вы изначально вводили что-то неверно.' \
                   f' Выберите, что хотите поменять' \
                   f' или вернитесь назад в <b><i>главное меню:</i></b>'

CHANGE_NAME_MESSAGE = '🛠 <i>Отправьте свое <b>Имя</b> и <b>Фамилию</b>, чтобы поменять настройки:</i>'

CHANGE_NAME_SUCCESS_MESSAGE = '✅🛠✅Настройки <b>имени</b> успешно применены!'

CHANGE_PHONE_MESSAGE = '🛠 <i>Отправьте свой номер телефона, чтобы поменять настройки:</i>'

CHANGE_PHONE_SUCCESS_MESSAGE = '✅🛠✅Настройки <b>номера</b> успешно применены!'

CHOOSE_COMMUNICATE_METHOD_MESSAGE = "👇 <i>Выберите способ связи из нижеперечисленного списка:</i>"

DISPATCHER_WILL_CALL_MESSAGE = '✅<b>Отлично!</b> Наш диспетчер перезвонит Вам в ближайшее время.'

DISPATCHER_CHAT_MESSAGE = '✅📞✅Добрый день! Я - диспетчер управляющей компании "УЭР-ЮГ", готов помочь Вам. ' \
                          'Напишите, пожалуйста интересующий Вас вопрос и ожидайте'

WELCOME_ADMIN_PANEL_MESSAGE = "Добро пожаловать в панель администратора, здесь можно сделать рассылку всем" \
                              " пользователям, посмотреть список пользователей," \
                              " а также управлять доступом пользователей"


def confirm_phone_number(phone: str) -> str:
    message = f'<b>Это Ваш верный номер телефона</b> <code>{phone}</code>? ' \
              f'<i>Если да, нажмите соответствующую кнопку, <b>если нет,</b></i>' \
              f'впишите свой актуальный номер телефона здесь'
    return message


def chat_with_user_message(tg_username, full_name, tg_id, text) -> str:
    message = f"<a href='https://t.me/{tg_username}'>{tg_username} {tg_id}</a>\n" \
              f"{full_name} пишет:\n {text}"
    return message


def chat_with_user_end_message(tg_username, full_name) -> str:
    message = f"Пользователь <a href='https://t.me/{tg_username}'>{tg_username}</a>\n" \
              f"{full_name} завершил диалог 📞✅"
    return message


def request_chat_message(tg_username, full_name, phone, address, description) -> str:
    message = f"⛔<b>Поступила новая жалоба</b>\n<a href='https://t.me/{tg_username}'>{tg_username}</a>\n" \
              f"<b>Имя и Фамилия:</b> {full_name}\n<b>Номер телефона:</b> <code>{phone}</code>\n"
    if address:
        message += f"<b>Адрес:</b> {address}\n"
    message += f"<b>Содержание:</b> {description}"
    return message


def please_call_message(tg_username, full_name, phone) -> str:
    message = f"⛔<b>Поступила заявка на обратный звонок</b>\n<a href='https://t.me/{tg_username}'>{tg_username}</a>\n" \
              f"<b>Имя и Фамилия:</b> {full_name}\n<b>Номер телефона:</b> <code>{phone}</code>\n"
    return message


def offer_chat_message(tg_username, full_name, phone, description):
    message = f"💡<b>Поступило новое предложение</b>\n<a href='https://t.me/{tg_username}'>{tg_username}</a>\n" \
              f"<b>Имя и Фамилия:</b> {full_name}\n<b>Номер телефона:</b> <code>{phone}</code>\n"
    if description:
        message += f"<b>Содержание:</b> {description}"
    return message
